; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-37)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 ball36 ball37 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(ball ball36)
(ball ball37)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room4)
(at ball13 room4)
(at ball14 room4)
(at ball15 room4)
(at ball16 room4)
(at ball17 room5)
(at ball18 room5)
(at ball19 room5)
(at ball20 room5)
(at ball21 room5)
(at ball22 room5)
(at ball23 room5)
(at ball24 room5)
(at ball25 room5)
(at ball26 room5)
(at ball27 room5)
(at ball28 room6)
(at ball29 room6)
(at ball30 room6)
(at ball31 room6)
(at ball32 room6)
(at ball33 room6)
(at ball34 room6)
(at ball35 room6)
(at ball36 room6)
(at ball37 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 room3)
(at ball2 room3)
(at ball3 room3)
(at ball4 room3)
(at ball5 room3)
(at ball6 room3)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
(at ball26 room3)
(at ball27 room3)
(at ball28 room3)
(at ball29 room3)
(at ball30 room3)
(at ball31 room3)
(at ball32 room3)
(at ball33 room3)
(at ball34 room3)
(at ball35 room3)
(at ball36 room3)
(at ball37 room3)
)
)
)

; plan
1. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 4 of 37
2. (pick ball2 rooma right)
   deleted: (at ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 4 of 37
3. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 4 of 37
4. (drop ball2 room3 right)
   deleted: (carry ball2 right)
   added: (at ball2 room3) (free right)
   goals met: 5 of 37
5. (drop ball3 room3 left)
   deleted: (carry ball3 left)
   added: (at ball3 room3) (free left)
   goals met: 6 of 37
6. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 6 of 37
7. (pick ball7 roomb left)
   deleted: (at ball7 roomb) (free left)
   added: (carry ball7 left)
   goals met: 6 of 37
8. (pick ball6 roomb right)
   deleted: (at ball6 roomb) (free right)
   added: (carry ball6 right)
   goals met: 6 of 37
9. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 6 of 37
10. (drop ball6 room3 right)
   deleted: (carry ball6 right)
   added: (at ball6 room3) (free right)
   goals met: 7 of 37
11. (drop ball7 room3 left)
   deleted: (carry ball7 left)
   added: (at ball7 room3) (free left)
   goals met: 8 of 37
12. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 8 of 37
13. (pick ball5 roomb left)
   deleted: (at ball5 roomb) (free left)
   added: (carry ball5 left)
   goals met: 8 of 37
14. (pick ball4 roomb right)
   deleted: (at ball4 roomb) (free right)
   added: (carry ball4 right)
   goals met: 8 of 37
15. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 8 of 37
16. (move room6 room3)
   deleted: (at-robby room6)
   added: (at-robby room3)
   goals met: 8 of 37
17. (drop ball4 room3 right)
   deleted: (carry ball4 right)
   added: (at ball4 room3) (free right)
   goals met: 9 of 37
18. (drop ball5 room3 left)
   deleted: (carry ball5 left)
   added: (at ball5 room3) (free left)
   goals met: 10 of 37
19. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 10 of 37
20. (pick ball37 room6 left)
   deleted: (at ball37 room6) (free left)
   added: (carry ball37 left)
   goals met: 10 of 37
21. (pick ball36 room6 right)
   deleted: (at ball36 room6) (free right)
   added: (carry ball36 right)
   goals met: 10 of 37
22. (move room6 room3)
   deleted: (at-robby room6)
   added: (at-robby room3)
   goals met: 10 of 37
23. (drop ball36 room3 right)
   deleted: (carry ball36 right)
   added: (at ball36 room3) (free right)
   goals met: 11 of 37
24. (drop ball37 room3 left)
   deleted: (carry ball37 left)
   added: (at ball37 room3) (free left)
   goals met: 12 of 37
25. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 12 of 37
26. (pick ball35 room6 left)
   deleted: (at ball35 room6) (free left)
   added: (carry ball35 left)
   goals met: 12 of 37
27. (pick ball34 room6 right)
   deleted: (at ball34 room6) (free right)
   added: (carry ball34 right)
   goals met: 12 of 37
28. (move room6 room3)
   deleted: (at-robby room6)
   added: (at-robby room3)
   goals met: 12 of 37
29. (drop ball34 room3 right)
   deleted: (carry ball34 right)
   added: (at ball34 room3) (free right)
   goals met: 13 of 37
30. (drop ball35 room3 left)
   deleted: (carry ball35 left)
   added: (at ball35 room3) (free left)
   goals met: 14 of 37
31. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 14 of 37
32. (pick ball33 room6 left)
   deleted: (at ball33 room6) (free left)
   added: (carry ball33 left)
   goals met: 14 of 37
33. (pick ball32 room6 right)
   deleted: (at ball32 room6) (free right)
   added: (carry ball32 right)
   goals met: 14 of 37
34. (move room6 room3)
   deleted: (at-robby room6)
   added: (at-robby room3)
   goals met: 14 of 37
35. (drop ball32 room3 right)
   deleted: (carry ball32 right)
   added: (at ball32 room3) (free right)
   goals met: 15 of 37
36. (drop ball33 room3 left)
   deleted: (carry ball33 left)
   added: (at ball33 room3) (free left)
   goals met: 16 of 37
37. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 16 of 37
38. (pick ball31 room6 left)
   deleted: (at ball31 room6) (free left)
   added: (carry ball31 left)
   goals met: 16 of 37
39. (pick ball30 room6 right)
   deleted: (at ball30 room6) (free right)
   added: (carry ball30 right)
   goals met: 16 of 37
40. (move room6 room3)
   deleted: (at-robby room6)
   added: (at-robby room3)
   goals met: 16 of 37
41. (drop ball30 room3 right)
   deleted: (carry ball30 right)
   added: (at ball30 room3) (free right)
   goals met: 17 of 37
42. (drop ball31 room3 left)
   deleted: (carry ball31 left)
   added: (at ball31 room3) (free left)
   goals met: 18 of 37
43. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 18 of 37
44. (pick ball29 room6 left)
   deleted: (at ball29 room6) (free left)
   added: (carry ball29 left)
   goals met: 18 of 37
45. (pick ball28 room6 right)
   deleted: (at ball28 room6) (free right)
   added: (carry ball28 right)
   goals met: 18 of 37
46. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 18 of 37
47. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 18 of 37
48. (drop ball28 room3 right)
   deleted: (carry ball28 right)
   added: (at ball28 room3) (free right)
   goals met: 19 of 37
49. (drop ball29 room3 left)
   deleted: (carry ball29 left)
   added: (at ball29 room3) (free left)
   goals met: 20 of 37
50. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 20 of 37
51. (pick ball27 room5 left)
   deleted: (at ball27 room5) (free left)
   added: (carry ball27 left)
   goals met: 20 of 37
52. (pick ball26 room5 right)
   deleted: (at ball26 room5) (free right)
   added: (carry ball26 right)
   goals met: 20 of 37
53. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 20 of 37
54. (drop ball26 room3 right)
   deleted: (carry ball26 right)
   added: (at ball26 room3) (free right)
   goals met: 21 of 37
55. (drop ball27 room3 left)
   deleted: (carry ball27 left)
   added: (at ball27 room3) (free left)
   goals met: 22 of 37
56. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 22 of 37
57. (pick ball25 room5 left)
   deleted: (at ball25 room5) (free left)
   added: (carry ball25 left)
   goals met: 22 of 37
58. (pick ball24 room5 right)
   deleted: (at ball24 room5) (free right)
   added: (carry ball24 right)
   goals met: 22 of 37
59. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 22 of 37
60. (drop ball24 room3 right)
   deleted: (carry ball24 right)
   added: (at ball24 room3) (free right)
   goals met: 23 of 37
61. (drop ball25 room3 left)
   deleted: (carry ball25 left)
   added: (at ball25 room3) (free left)
   goals met: 24 of 37
62. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 24 of 37
63. (pick ball23 room5 left)
   deleted: (at ball23 room5) (free left)
   added: (carry ball23 left)
   goals met: 24 of 37
64. (pick ball22 room5 right)
   deleted: (at ball22 room5) (free right)
   added: (carry ball22 right)
   goals met: 24 of 37
65. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 24 of 37
66. (drop ball22 room3 right)
   deleted: (carry ball22 right)
   added: (at ball22 room3) (free right)
   goals met: 25 of 37
67. (drop ball23 room3 left)
   deleted: (carry ball23 left)
   added: (at ball23 room3) (free left)
   goals met: 26 of 37
68. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 26 of 37
69. (pick ball21 room5 left)
   deleted: (at ball21 room5) (free left)
   added: (carry ball21 left)
   goals met: 26 of 37
70. (pick ball20 room5 right)
   deleted: (at ball20 room5) (free right)
   added: (carry ball20 right)
   goals met: 26 of 37
71. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 26 of 37
72. (drop ball20 room3 right)
   deleted: (carry ball20 right)
   added: (at ball20 room3) (free right)
   goals met: 27 of 37
73. (drop ball21 room3 left)
   deleted: (carry ball21 left)
   added: (at ball21 room3) (free left)
   goals met: 28 of 37
74. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 28 of 37
75. (pick ball19 room5 left)
   deleted: (at ball19 room5) (free left)
   added: (carry ball19 left)
   goals met: 28 of 37
76. (pick ball18 room5 right)
   deleted: (at ball18 room5) (free right)
   added: (carry ball18 right)
   goals met: 28 of 37
77. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 28 of 37
78. (drop ball18 room3 right)
   deleted: (carry ball18 right)
   added: (at ball18 room3) (free right)
   goals met: 29 of 37
79. (drop ball19 room3 left)
   deleted: (carry ball19 left)
   added: (at ball19 room3) (free left)
   goals met: 30 of 37
80. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 30 of 37
81. (pick ball17 room5 left)
   deleted: (at ball17 room5) (free left)
   added: (carry ball17 left)
   goals met: 30 of 37
82. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 30 of 37
83. (pick ball16 room4 right)
   deleted: (at ball16 room4) (free right)
   added: (carry ball16 right)
   goals met: 30 of 37
84. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 30 of 37
85. (drop ball16 room3 right)
   deleted: (carry ball16 right)
   added: (at ball16 room3) (free right)
   goals met: 31 of 37
86. (drop ball17 room3 left)
   deleted: (carry ball17 left)
   added: (at ball17 room3) (free left)
   goals met: 32 of 37
87. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 32 of 37
88. (pick ball15 room4 left)
   deleted: (at ball15 room4) (free left)
   added: (carry ball15 left)
   goals met: 32 of 37
89. (pick ball14 room4 right)
   deleted: (at ball14 room4) (free right)
   added: (carry ball14 right)
   goals met: 32 of 37
90. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 32 of 37
91. (drop ball14 room3 right)
   deleted: (carry ball14 right)
   added: (at ball14 room3) (free right)
   goals met: 33 of 37
92. (drop ball15 room3 left)
   deleted: (carry ball15 left)
   added: (at ball15 room3) (free left)
   goals met: 34 of 37
93. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 34 of 37
94. (pick ball13 room4 left)
   deleted: (at ball13 room4) (free left)
   added: (carry ball13 left)
   goals met: 34 of 37
95. (pick ball12 room4 right)
   deleted: (at ball12 room4) (free right)
   added: (carry ball12 right)
   goals met: 34 of 37
96. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 34 of 37
97. (drop ball12 room3 right)
   deleted: (carry ball12 right)
   added: (at ball12 room3) (free right)
   goals met: 35 of 37
98. (drop ball13 room3 left)
   deleted: (carry ball13 left)
   added: (at ball13 room3) (free left)
   goals met: 36 of 37
99. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 36 of 37
100. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 36 of 37
101. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 36 of 37
102. (drop ball1 room3 left)
   deleted: (carry ball1 left)
   added: (at ball1 room3) (free left)
   goals met: 37 of 37
